# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

# Persiapan Data Frame

In [3]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)),
                 columns=cols)
df

   usia
0     5
1    32
2    85
3    18
4    73
5    81
6    77
7    29
8    74
9    12

# Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan cut()

In [4]:
df['kelompok_usia'] = pd.cut(df['usia'],
                             bins = [0, 18, 65, 99],
                             labels = ['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0     5          anak
1    32        dewasa
2    85        manula
3    18          anak
4    73        manula
5    81        manula
6    77        manula
7    29        dewasa
8    74        manula
9    12          anak